In [1]:
import pandas as pd

 > ## __i__ in the __iloc__ stands for the __interger__

In [2]:
df = pd.read_csv(r"C:\Users\user\Downloads\Companies.csv")

In [5]:
df.head()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"

> ### __df.iloc["row number" , "col number"]__

##  follows the exclusive propert  that is (start : end-1)

In [51]:
df[df.iloc[1,1:3] ]

KeyError: "None of [Index(['Amazon', 'Retail and cloud computing'], dtype='object')] are in the [columns]"

In [8]:
df.iloc[1:4, 2:5]

# follows the exclusive propert  that is (start : end-1)

                     Industry Revenue (USD millions) Revenue growth
1  Retail and cloud computing                513,983           9.4%
2          Petroleum industry                413,680          44.8%
3        Electronics industry                394,328           7.8%

In [7]:
df.loc[56]

Rank                                  57
Name                               Sysco
Industry                    Food service
Revenue (USD millions)            68,636
Revenue growth                     33.8%
Employees                         70,510
Headquarters              Houston, Texas
Name: 56, dtype: object

In [6]:
df.iloc[56,5]

'70,510'

> # pandas default uses the iloc as the slicing element

In [9]:
df.iloc[0:2] # same as below

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"

In [11]:
df[0:2] # same as below

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"

# difference of loc and iloc

 > ### 1 ) in __loc__ we __can__ use the __charater__ and in __iloc__ we __can not__ use the chararter to find the data

In [12]:
df.loc[0:5,"Name"]

0               Walmart
1                Amazon
2            ExxonMobil
3                 Apple
4    UnitedHealth Group
5            CVS Health
Name: Name, dtype: object

In [13]:
df.iloc[0:5,"Name"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [15]:
df.iloc[0:5,1]

0               Walmart
1                Amazon
2            ExxonMobil
3                 Apple
4    UnitedHealth Group
Name: Name, dtype: object

In [16]:
add of all number from the number

SyntaxError: invalid syntax (2539248025.py, line 1)

In [ ]:
def sum () : 
    inm = 0
    for i inm :

In [49]:
n = int(input("enter a number"))

tp = []
st2 = str(n)
for i in st2 :

    # type52 = int(i)
    type2 = int(i)
    tp.append(type2)
    
# print(tp) 
sum(tp)

20

In [23]:
em

[5, 6, 3]

In [32]:
sum(2,2)

TypeError: 'int' object is not iterable

In [53]:
df

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"
...,...,...,...,...,...,...,...
95,96,Best Buy,Retail,"46,298",10.6%,"71,100","Richfield, Minnesota"
96,97,Bristol-Myers Squibb,Pharmaceutical industry,"46,159",0.5%,"34,300","New York City, New York"
97,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
98,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
99,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"

In [60]:
se = df.iloc[0:5,1:3]

In [61]:
type(se)

pandas.core.frame.DataFrame

In [62]:
se

                 Name                    Industry
0             Walmart                      Retail
1              Amazon  Retail and cloud computing
2          ExxonMobil          Petroleum industry
3               Apple        Electronics industry
4  UnitedHealth Group                  Healthcare

In [63]:
df[1:5]

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"